src/Part1-100DaysOfMLCode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-10 Tue 21:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>100 Days Of Machine Learning Code</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sergio-Feliciano Mendoza-Barrera" />
<meta name="description" content="Deep Learning Specialization series course"
 />
<meta name="keywords" content="R, data science, emacs, ESS, org-mode, deep learning" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">100 Days Of Machine Learning Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35c371c">1. 100DaysOfMLCodeSFMB</a></li>
<li><a href="#org2d4f773">2. Day 1 [Thu Jul  5 20:58:13 CDT 2018]</a>
<ul>
<li><a href="#org744db68">2.1. Siraj Raval Tweet</a></li>
<li><a href="#org5bc5be3">2.2. Challenge</a></li>
<li><a href="#org72c851c">2.3. Following my own path using Julia, R and Python</a></li>
<li><a href="#org57d2d2c">2.4. Install Julia</a></li>
<li><a href="#org0fd9fd1">2.5. Install python</a></li>
<li><a href="#orgb683e9e">2.6. Install Emacs</a></li>
</ul>
</li>
<li><a href="#org92df3e7">3. Day 2 [Fri Jul  6 19:21:03 CDT 2018]</a>
<ul>
<li><a href="#orgc995290">3.1. Course description</a></li>
<li><a href="#orge819364">3.2. Prerequisites</a></li>
<li><a href="#orge148a80">3.3. Grading</a></li>
<li><a href="#orgb2bbfe5">3.4. Problem Sets</a></li>
<li><a href="#org11b314b">3.5. Projects</a></li>
<li><a href="#orge93050c">3.6. Syllabus</a></li>
<li><a href="#orge27aec7">3.7. Class 1. Course at a Glance</a></li>
</ul>
</li>
<li><a href="#org163688e">4. Day 3 [Sat Jul  7 13:12:57 CDT 2018]</a></li>
<li><a href="#org60b181e">5. Day 4 [Sun Jul  8 12:59:19 CDT 2018]</a></li>
<li><a href="#orgd04d56d">6. Day 5 [Mon Jul  9 16:12:01 CDT 2018]</a>
<ul>
<li><a href="#org7b2a36c">6.1. Math camp</a></li>
</ul>
</li>
<li><a href="#orgef6bd3d">7. Day 6 (Pending)</a>
<ul>
<li><a href="#org4e7e090">7.1. 9.520/6.860, Class 02</a></li>
</ul>
</li>
<li><a href="#orgf64e6e4">8. References</a></li>
</ul>
</div>
</div>
<div class="ABSTRACT">
<p>
According to the challenge we are going to explore a project and maybe
the possibility to monetize a solution of an industry problem using
ML.
</p>

<p>
<a href="https://twitter.com/sirajraval/status/1014758160572141568">URL</a>
</p>

<p>
"Who’s ready to take the 100 days of ML code challenge? That means
coding machine learning for at least an hour everyday for the next 100
days. Pledge with the #100DaysOfMLCode hashtag, I’ll give the first
few winners a shoutout!"
</p>

</div>

<div id="outline-container-org35c371c" class="outline-2">
<h2 id="org35c371c"><span class="section-number-2">1</span> 100DaysOfMLCodeSFMB</h2>
<div class="outline-text-2" id="text-1">
<p>
After read this tweet can be a great way to master something, do not
know what is, yet.
</p>

<p>
In day 2 I decided to explore the MIT course <b>9.520/6.860: Statistical
Learning Theory and Applications</b> <a href="http://www.mit.edu/~9.520/fall17/">Fall 2017</a>.
</p>
</div>
</div>

<div id="outline-container-org2d4f773" class="outline-2">
<h2 id="org2d4f773"><span class="section-number-2">2</span> Day 1 [Thu Jul  5 20:58:13 CDT 2018]</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org744db68" class="outline-3">
<h3 id="org744db68"><span class="section-number-3">2.1</span> Siraj Raval Tweet</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Who’s ready to take the 100 days of ML code challenge? That means
coding machine learning for at least an hour everyday for the next 100
days. Pledge with the #100DaysOfMLCode hashtag, I’ll give the first
few winners a shoutout!
</p>

<p>
<a href="https://twitter.com/sirajraval/status/1014758160572141568">Link to Tweet</a>.
</p>
</div>
</div>

<div id="outline-container-org5bc5be3" class="outline-3">
<h3 id="org5bc5be3"><span class="section-number-3">2.2</span> Challenge</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pick an industry that sounds exciting, find a problem they have, think
about how AI could be applied to that problem, locate a relevant
dataset, apply AI to the dataset, monetize the solution.
</p>
</div>
</div>

<div id="outline-container-org72c851c" class="outline-3">
<h3 id="org72c851c"><span class="section-number-3">2.3</span> Following my own path using Julia, R and Python</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In that order, trying to go as far as I can using the first one
syntax.
</p>
</div>
</div>

<div id="outline-container-org57d2d2c" class="outline-3">
<h3 id="org57d2d2c"><span class="section-number-3">2.4</span> Install Julia</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-text">   _       _ _(_)_     |  A fresh approach to technical computing
  (_)     | (_) (_)    |  Documentation: https://docs.julialang.org
   _ _   _| |_  __ _   |  Type "?help" for help.
  | | | | | | |/ _` |  |
  | | |_| | | | (_| |  |  Version 0.6.3 (2018-05-28 20:20 UTC)
 _/ |\__'_|_|_|\__'_|  |  Official http://julialang.org/ release
|__/                   |  x86_64-pc-linux-gnu
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fd9fd1" class="outline-3">
<h3 id="org0fd9fd1"><span class="section-number-3">2.5</span> Install python</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-text">Python version ::
sys.version_info(major=3, minor=6, micro=5, releaselevel='final', serial=0)
=================
OpenCV version ::
3.4.0
=================
Tensorflow version ::
1.4.1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb683e9e" class="outline-3">
<h3 id="orgb683e9e"><span class="section-number-3">2.6</span> Install Emacs</h3>
<div class="outline-text-3" id="text-2-6">
<p>
I am joking, Emacs is always installed ;-).
</p>
</div>
</div>
</div>

<div id="outline-container-org92df3e7" class="outline-2">
<h2 id="org92df3e7"><span class="section-number-2">3</span> Day 2 [Fri Jul  6 19:21:03 CDT 2018]</h2>
<div class="outline-text-2" id="text-3">
<p>
9.520/6.860: Statistical Learning Theory and Applications, Fall 2017
</p>

<p>
<b>Instructors</b>: <a href="http://cbcl.mit.edu/people/poggio/poggio-new.htm">Tomaso Poggio (TP)</a>, <a href="http://web.mit.edu/lrosasco/www/">Lorenzo Rosasco (LR)</a>, <a href="http://web.mit.edu/gevang/www/">Georgios
Evangelopoulos (GE)</a>
</p>
</div>
