src/Part1-100DaysOfMLCode.org
** Course description

The course covers foundations and recent advances of Machine Learning
from the point of view of Statistical Learning and Regularization
Theory.

Understanding intelligence and how to replicate it in machines is
arguably one of the greatest problems in science. Learning, its
principles and computational implementations, is at the very core of
intelligence. During the last decade, for the first time, we have been
able to develop artificial intelligence systems that can solve complex
tasks, until recently the exclusive domain of biological organisms,
such as computer vision, speech recognition or natural language
understanding: cameras recognize faces, smart phones understand voice
commands, smart speakers/assistants answer questions and cars can see
and avoid obstacles.

The machine learning algorithms that are at the roots of these success
stories are trained with labeled examples rather than programmed to
solve a task. Among the approaches in modern machine learning, the
course focuses on regularization techniques, that provide a
theoretical foundation to high-dimensional supervised
learning. Besides classic approaches such as Support Vector Machines,
the course covers state of the art techniques using sparsity or data
geometry (aka manifold learning), a variety of algorithms for
supervised learning (batch and online), feature selection, structured
prediction, and multitask learning and principles for designing or
learning data representations. Concepts from optimization theory
useful for machine learning are covered in some detail (first order
methods, proximal/splitting techniques,...).

The final part of the course will focus on deep learning networks. It
will introduce an emerging theory formalizing three key areas for the
rigorous characterization of deep learning: approximation theory --
which functions can be represented efficiently?; optimization theory
-- how easy is it to minimize the training error?; and generalization
properties -- is classical learning theory sufficient for deep
learning? It will also outline a theory of hierarchical architectures
that aims to explain how to build machine that learn using cortex
principles and similar to how children learn: from few labeled and
many more unlabeled data.

The goal of the course is to provide students with the theoretical
knowledge and the basic intuitions needed to use and develop effective
machine learning solutions to challenging problems.

** Prerequisites

We will make extensive use of basic notions of calculus, linear
algebra and probability. The essentials are covered in class and in
the math camp material. We will introduce a few concepts in
functional/convex analysis and optimization. Note that this is an
advanced graduate course and some exposure on introductory Machine
Learning concepts or courses is expected. Students are also expected
to have basic familiarity with MATLAB/Octave.

** Grading

Pset and project tentative dates: ([[https://docs.google.com/presentation/d/1xt7U25g0AmOrBFxprJyq78qD45g80bH9Y2TbUNokYTE/][slides]]).

** Problem Sets

Problem Set 1
Problem Set 2
Problem Set 3
Problem Set 4

Submission instructions: Follow the instructions included with the
problem set. Use the [[http://www.mit.edu/~9.520/fall17/slides/9.520_pset_template.zip][latex template]] for the report (there is a maximum
page limit). Submit your report online through stellar.mit by the due
date/time and a printout in the first class after the due date.

** Projects

Reports are 1-page, extended abstracts using [[http://www.mit.edu/~9.520/fall17/slides/9.520_project_report_template.zip][NIPS style files]].

*** Projects archive

[[http://www.mit.edu/~9.520/wikiprojects.html][List of Wikipedia]] entries, created or edited as part of projects
during previous course offerings.

