src/Part1-100DaysOfMLCode.org
** Syllabus

[[http://www.mit.edu/~9.520/fall17/#briefsyllabus][URL]].

Follow the link for each class to find a detailed description,
suggested readings, and class slides. Some of the later classes may be
subject to reordering or rescheduling.

| Class    | Date       | Title                                                        | Instructor(s) |
|----------+------------+--------------------------------------------------------------+---------------|
| Class 01 | Wed Sep 06 | [[http://www.mit.edu/~9.520/fall17/Classes/course_glance.html][The Course at a Glance]]                                       | TP            |
| Class 02 | Mon Sep 11 | [[http://www.mit.edu/~9.520/fall17/Classes/learning_problem.html][The Learning Problem and Regularization]]                      | LR            |
| Class 03 | Wed Sep 13 | Reproducing Kernel Hilbert Spaces                            | LR            |
| Class 04 | Mon Sep 18 | Positive Definite Functions, Feature Maps and Mercer Theorem | LR            |
| Class 05 | Wed Sep 20 | Tikhonov Regularization and the Representer Theorem          | LR            |
| Class 06 | Mon Sep 25 | Logistic Regression and Support Vector Machines              | LR            |
| Class 07 | Wed Sep 27 | Regularized Least Squares                                    | LR            |
| Class 08 | Mon Oct 02 | Iterative Regularization via Early Stopping                  | LR            |
| Class 09 | Wed Oct 04 | Learning with Stochastic Gradients                           | LR            |
| Class 10 | Wed Oct 11 | Large Scale Kernel Methods                                   | LR            |
| Class 11 | Mon Oct 16 | Sparsity Based Regularization                                | LR            |
| Class 12 | Wed Oct 18 | Convex Relaxation and Proximal Gradient                      | LR            |
| Class 13 | Mon Oct 23 | Structured Sparsity Regularization                           | LR            |
| Class 14 | Wed Oct 25 | Multiple Kernel Learning                                     | LR            |
| Class 15 | Mon Oct 30 | Learning Theory                                              | LR            |
| Class 16 | Wed Nov 01 | Generalization Error and Stability                           | LR            |
| Class 17 | Mon Nov 06 | Online Learning II                                           | Sasha Rakhlin |
| Class 18 | Wed Nov 08 | Online Learning II                                           | Sasha Rakhlin |
| Class 19 | Mon Nov 13 | Data Representation by Design                                | GE            |
| Class 20 | Wed Nov 15 | Learning Data Representation: Dictionary Learning            | GE            |
| Class 21 | Mon Nov 20 | Learning Data Representation: Neural Networks                | GE            |
| Class 22 | Wed Nov 22 | Deep Learning Theory: Approximation                          | TP            |
| Class 23 | Mon Nov 27 | Deep Learning Theory: Optimization                           | TP            |
| Class 24 | Wed Nov 29 | Deep Learning Theory: Generalization                         | TP            |
| Class 25 | Mon Dec 04 | Learning Data Representation: Invariance and Selectivity     | TP            |
| Class 26 | Wed Dec 06 | Deep Networks and Visual Cortex                              | TP            |
| Class 27 | Mon Dec 11 | Poster presentations (2 sessions)                            |               |

** Class 1. Course at a Glance

*** Description

We introduce and motivate the main theme of much of the course,
setting the problem of supervised learning from examples as the
ill-posed problem of approximating a multivariate function from sparse
data. We present an overview of the theoretical part of the course and
sketch the connection between classical Regularization Theory with its
RKHS-based algorithms and Learning Theory. We briefly describe several
different applications ranging from vision to computer graphics, to
finance and neuroscience. The last third of the course will be on data
representations for learning and deep learning. It will introduce
recent theoretical developments towards a) understanding why deep
learning works and b) a new phase in machine learning, beyond
classical supervised learning: how to learn in an unsupervised way
representations that significantly decrease the sample complexity of a
supervised learning.

*** Slides

- Slides for this lecture: [[file:../docs/class01_2017.pdf][PDF]].

**** Youtube video class 2015.

[[yt:6AWZS4Ho2Z8]]

[[https://youtu.be/6AWZS4Ho2Z8][Link here]]

**** 2017 Course - [[https://cbmm.mit.edu][Center for Brains, Minds and Machines]] (CBMM)

[[yt:Q5itLKscYTA]]

[[https://youtu.be/Q5itLKscYTA][Link here]]

*** Relevant Reading

- Mnih et. al. (Deep Mind), [[http://www.nature.com/nature/journal/v518/n7540/full/nature14236.html][Human-level control through deep
  reinforcement learning]], Nature 518, pp. 529-533, 2015.
- Nature Insights, [[http://www.nature.com/nature/supplements/insights/machine-intelligence/index.html][Machine Intelligence]] (with review article on Deep
  Learning), Nature, Vol. 521 No. 7553, pp. 435-482, 2015.

* Day 3 [Sat Jul  7 13:12:57 CDT 2018]

1. Class 1 video [14.51]
2. Slide [26]

* Day 4 [Sun Jul  8 12:59:19 CDT 2018]

1. Class 1 Done

* Day 5 [Mon Jul  9 16:12:01 CDT 2018]

** Math camp

Math camp extra class, optional for those interested: Tue. 09/12, 4:00
pm - 5:30 pm, Singleton auditorium (46-3002).

