src/Part1-100DaysOfMLCode.html

<div id="outline-container-orge93050c" class="outline-3">
<h3 id="orge93050c"><span class="section-number-3">3.6</span> Syllabus</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<a href="http://www.mit.edu/~9.520/fall17/#briefsyllabus">URL</a>.
</p>

<p>
Follow the link for each class to find a detailed description,
suggested readings, and class slides. Some of the later classes may be
subject to reordering or rescheduling.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Instructor(s)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Class 01</td>
<td class="org-left">Wed Sep 06</td>
<td class="org-left"><a href="http://www.mit.edu/~9.520/fall17/Classes/course_glance.html">The Course at a Glance</a></td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 02</td>
<td class="org-left">Mon Sep 11</td>
<td class="org-left"><a href="http://www.mit.edu/~9.520/fall17/Classes/learning_problem.html">The Learning Problem and Regularization</a></td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 03</td>
<td class="org-left">Wed Sep 13</td>
<td class="org-left">Reproducing Kernel Hilbert Spaces</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 04</td>
<td class="org-left">Mon Sep 18</td>
<td class="org-left">Positive Definite Functions, Feature Maps and Mercer Theorem</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 05</td>
<td class="org-left">Wed Sep 20</td>
<td class="org-left">Tikhonov Regularization and the Representer Theorem</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 06</td>
<td class="org-left">Mon Sep 25</td>
<td class="org-left">Logistic Regression and Support Vector Machines</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 07</td>
<td class="org-left">Wed Sep 27</td>
<td class="org-left">Regularized Least Squares</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 08</td>
<td class="org-left">Mon Oct 02</td>
<td class="org-left">Iterative Regularization via Early Stopping</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 09</td>
<td class="org-left">Wed Oct 04</td>
<td class="org-left">Learning with Stochastic Gradients</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 10</td>
<td class="org-left">Wed Oct 11</td>
<td class="org-left">Large Scale Kernel Methods</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 11</td>
<td class="org-left">Mon Oct 16</td>
<td class="org-left">Sparsity Based Regularization</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 12</td>
<td class="org-left">Wed Oct 18</td>
<td class="org-left">Convex Relaxation and Proximal Gradient</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 13</td>
<td class="org-left">Mon Oct 23</td>
<td class="org-left">Structured Sparsity Regularization</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 14</td>
<td class="org-left">Wed Oct 25</td>
<td class="org-left">Multiple Kernel Learning</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 15</td>
<td class="org-left">Mon Oct 30</td>
<td class="org-left">Learning Theory</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 16</td>
<td class="org-left">Wed Nov 01</td>
<td class="org-left">Generalization Error and Stability</td>
<td class="org-left">LR</td>
</tr>

<tr>
<td class="org-left">Class 17</td>
<td class="org-left">Mon Nov 06</td>
<td class="org-left">Online Learning II</td>
<td class="org-left">Sasha Rakhlin</td>
</tr>

<tr>
<td class="org-left">Class 18</td>
<td class="org-left">Wed Nov 08</td>
<td class="org-left">Online Learning II</td>
<td class="org-left">Sasha Rakhlin</td>
</tr>

<tr>
<td class="org-left">Class 19</td>
<td class="org-left">Mon Nov 13</td>
<td class="org-left">Data Representation by Design</td>
<td class="org-left">GE</td>
</tr>

<tr>
<td class="org-left">Class 20</td>
<td class="org-left">Wed Nov 15</td>
<td class="org-left">Learning Data Representation: Dictionary Learning</td>
<td class="org-left">GE</td>
</tr>

<tr>
<td class="org-left">Class 21</td>
<td class="org-left">Mon Nov 20</td>
<td class="org-left">Learning Data Representation: Neural Networks</td>
<td class="org-left">GE</td>
</tr>

<tr>
<td class="org-left">Class 22</td>
<td class="org-left">Wed Nov 22</td>
<td class="org-left">Deep Learning Theory: Approximation</td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 23</td>
<td class="org-left">Mon Nov 27</td>
<td class="org-left">Deep Learning Theory: Optimization</td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 24</td>
<td class="org-left">Wed Nov 29</td>
<td class="org-left">Deep Learning Theory: Generalization</td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 25</td>
<td class="org-left">Mon Dec 04</td>
<td class="org-left">Learning Data Representation: Invariance and Selectivity</td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 26</td>
<td class="org-left">Wed Dec 06</td>
<td class="org-left">Deep Networks and Visual Cortex</td>
<td class="org-left">TP</td>
</tr>

<tr>
<td class="org-left">Class 27</td>
<td class="org-left">Mon Dec 11</td>
<td class="org-left">Poster presentations (2 sessions)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge27aec7" class="outline-3">
<h3 id="orge27aec7"><span class="section-number-3">3.7</span> Class 1. Course at a Glance</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<div id="outline-container-org101a5ac" class="outline-4">
<h4 id="org101a5ac"><span class="section-number-4">3.7.1</span> Description</h4>
<div class="outline-text-4" id="text-3-7-1">
<p>
We introduce and motivate the main theme of much of the course,
setting the problem of supervised learning from examples as the
ill-posed problem of approximating a multivariate function from sparse
data. We present an overview of the theoretical part of the course and
sketch the connection between classical Regularization Theory with its
RKHS-based algorithms and Learning Theory. We briefly describe several
different applications ranging from vision to computer graphics, to
finance and neuroscience. The last third of the course will be on data
representations for learning and deep learning. It will introduce
recent theoretical developments towards a) understanding why deep
learning works and b) a new phase in machine learning, beyond
classical supervised learning: how to learn in an unsupervised way
representations that significantly decrease the sample complexity of a
supervised learning.
</p>
</div>
</div>

<div id="outline-container-orgdc86356" class="outline-4">
<h4 id="orgdc86356"><span class="section-number-4">3.7.2</span> Slides</h4>
<div class="outline-text-4" id="text-3-7-2">
<ul class="org-ul">
<li>Slides for this lecture: <a href="../docs/class01_2017.pdf">PDF</a>.</li>
</ul>
</div>

<div id="outline-container-orge48a665" class="outline-5">
<h5 id="orge48a665"><span class="section-number-5">3.7.2.1</span> Youtube video class 2015.</h5>
<div class="outline-text-5" id="text-3-7-2-1">
<p>
<iframe width="640" height="480" src="https://www.youtube.com/embed/6AWZS4Ho2Z8" frameborder="0" allowfullscreen></iframe>
</p>

<p>
<a href="https://youtu.be/6AWZS4Ho2Z8">Link here</a>
</p>
</div>
</div>

<div id="outline-container-orga8b41ad" class="outline-5">
<h5 id="orga8b41ad"><span class="section-number-5">3.7.2.2</span> 2017 Course - <a href="https://cbmm.mit.edu">Center for Brains, Minds and Machines</a> (CBMM)</h5>
<div class="outline-text-5" id="text-3-7-2-2">
<p>
<iframe width="640" height="480" src="https://www.youtube.com/embed/Q5itLKscYTA" frameborder="0" allowfullscreen></iframe>
</p>

<p>
<a href="https://youtu.be/Q5itLKscYTA">Link here</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgd250fb3" class="outline-4">
<h4 id="orgd250fb3"><span class="section-number-4">3.7.3</span> Relevant Reading</h4>
<div class="outline-text-4" id="text-3-7-3">
<ul class="org-ul">
<li>Mnih et. al. (Deep Mind), <a href="http://www.nature.com/nature/journal/v518/n7540/full/nature14236.html">Human-level control through deep
reinforcement learning</a>, Nature 518, pp. 529-533, 2015.</li>
<li>Nature Insights, <a href="http://www.nature.com/nature/supplements/insights/machine-intelligence/index.html">Machine Intelligence</a> (with review article on Deep
Learning), Nature, Vol. 521 No. 7553, pp. 435-482, 2015.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org163688e" class="outline-2">
<h2 id="org163688e"><span class="section-number-2">4</span> Day 3 [Sat Jul  7 13:12:57 CDT 2018]</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Class 1 video [14.51]</li>
<li>Slide [26]</li>
</ol>
</div>
</div>

<div id="outline-container-org60b181e" class="outline-2">
<h2 id="org60b181e"><span class="section-number-2">5</span> Day 4 [Sun Jul  8 12:59:19 CDT 2018]</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Class 1 Done</li>
</ol>
</div>
</div>

<div id="outline-container-orgd04d56d" class="outline-2">
<h2 id="orgd04d56d"><span class="section-number-2">6</span> Day 5 [Mon Jul  9 16:12:01 CDT 2018]</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org7b2a36c" class="outline-3">
<h3 id="org7b2a36c"><span class="section-number-3">6.1</span> Math camp</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Math camp extra class, optional for those interested: Tue. 09/12, 4:00
pm - 5:30 pm, Singleton auditorium (46-3002).
</p>
</div>
