src/Part1-100DaysOfMLCode.org
*** Description

We review the basic prerequisites for the course on functional
analysis, linear algebra, probability theory and concentration of
measure.

*** Class Reference Material

**** Youtube video

[[yt:AsogCoscZgE]]

[[https://youtu.be/AsogCoscZgE][Link here]]

**** Local video

[[file:../videos/MathCampFor9_520_6_860S-StatisticalLearningTheoryAndApplications.mp4][Video]] file.

**** Slides

Slides: [[file:../docs/mathcamp-slides.pdf][PDF]]. [[http://www.mit.edu/~9.520/fall17/slides/mathcamp/mathcamp-slides.pdf][Original URL]].
Notes/Book appendix: [[file:../docs/mathcamp-fa-notes_book.pdf][PDF]]. [[http://www.mit.edu/~9.520/fall17/slides/mathcamp/mathcamp-fa-notes_book.pdf][Original URL]].

*** Some concept testing with data

We like $\mathbb{R}^D$ because we can

*Addition*

#+begin_src julia :session :results output :exports all
  v = [1, 2, 3];
  w = [4, 5, 6];
  println(v + w)
#+end_src

#+RESULTS:
:
:
: [5, 7, 9]

*Multiply by numbers*

#+begin_src julia :session :results output :exports all
  println(3 * v)
#+end_src

#+RESULTS:
: [3, 6, 9]

*Scalar product*

#+begin_src julia :session :results output :exports all
  println(v)
  println(w)
  dot(vec(v), vec(w))
  dot(v, w)
#+end_src

#+RESULTS:
: [1, 2, 3]
: [4, 5, 6]
: 32
: 32

*Norm*

#+begin_src julia :session :results output :exports all
  sqrt(dot(vec(v'), vec(v)))
  vecnorm(v)
  norm(v)
#+end_src

#+RESULTS:
: 3.7416573867739413
: 3.7416573867739413
: 3.7416573867739413

*Distances between vectors*

#+begin_src julia :session :results output :exports all
  vecnorm(v - w)
  norm(v - w)
#+end_src

#+RESULTS:
: 5.196152422706632
: 5.196152422706632

*RMS value*

#+begin_src julia :session :results output :exports all
  norm(v) / sqrt(length(v))
#+end_src

#+RESULTS:
: 2.160246899469287

*Standard deviation*

/Important note/: Julia do not use this definition.

#+begin_src julia :session :results output :exports all
  norm(v - mean(v))/sqrt(length(v))
#+end_src

#+RESULTS:
: 0.8164965809277261

Julia's way:

#+begin_src julia :session :results output :exports all
  std(v)
#+end_src

#+RESULTS:
: 1.0

*Angle between two vectors*

#+begin_src julia :session :results output :exports all
  acos(dot(v, w)/(norm(v) * norm(w)))
#+end_src

#+RESULTS:
: 0.2257261285527342

This what we called "Euclidean" structure. We want to do the samething
with $D = \infty$

*** Cauchy-Schwarz inequality

$\langle v, w \rangle \le \langle v, v \rangle^{\frac{1}{2}} \langle w, w \rangle^{\frac{1}{2}}$.

#+begin_src julia :session :results output :exports all
  println(":: v and w inner product ::")
  dot(v, w)
  println(":: must be less or equal to ::")
  sqrt(dot(v, v)) * sqrt(dot(w, w))
#+end_src

#+RESULTS:
: :: v and w inner product ::
: 32
: :: must be less or equal to ::
: 32.83291031876401

* Day 6 (Pending)

** 9.520/6.860, Class 02

*** Description

We formalize the problem of learning from examples in the framework of
statistical learning theory and introduce key terms and concepts such
as loss functions, empirical and excess risk, generalization error and
consistency. We briefly describe foundational results and introduce
the concepts of hypothesis space and regularization.

*** Class Reference Material

*L. Rosasco, T. Poggio, Machine Learning: a Regularization Approach,
MIT-9.520 Lectures Notes, Manuscript, Dec. 2017*.

*** Chapter 1 - Statistical Learning Theory

Note: The course notes, in the form of the circulated book draft is
the reference material for this class. Related and older material can
be accessed through previous year offerings of the course.

*** Further Reading

- F. Cucker and S. Smale, [[http://www.mit.edu/~9.520/Papers/cuckersmale.pdf][On the mathematical foundations of learning]],
  Bulletin of the American Mathematical Society, 2002.
- T. Evgeniou, M. Pontil and T. Poggio, [[http://cbcl.mit.edu/projects/cbcl/publications/ps/evgeniou-reviewall.pdf][Regularization networks and
  support vector machines]], Advances in Computational
  Mathematics, 2000.
- S. Villa, L. Rosasco and T. Poggio, [[http://arxiv.org/pdf/1303.5976v1.pdf][On learnability, complexity and
  stability]], "Empirical Inference, Festschrift in Honor of Vladimir
  N. Vapnik." Springer-Verlag, Chapter 7, 2013.
- V. Vapnik, An overview of statistical learning theory, IEEE
  Trans. on Neural Networks , 10(5), 1999.

*** Video

[[yt:SFxypsvhhMQ]]

[[https://youtu.be/SFxypsvhhMQ][Link here]]

* References

1. [[file:../docs/MLNotes.pdf][Introductory Machine Learning Notes. Lorenzo Rosasco,
   MIT, 2017]]. [[http://lcsl.mit.edu/courses/ml/1718/MLNotes.pdf][Original URL]].
