src/Part1-100DaysOfMLCode.html

<div id="outline-container-org2230b0a" class="outline-4">
<h4 id="org2230b0a"><span class="section-number-4">6.1.1</span> Description</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
We review the basic prerequisites for the course on functional
analysis, linear algebra, probability theory and concentration of
measure.
</p>
</div>
</div>

<div id="outline-container-orge40d4a0" class="outline-4">
<h4 id="orge40d4a0"><span class="section-number-4">6.1.2</span> Class Reference Material</h4>
<div class="outline-text-4" id="text-6-1-2">
</div>
<div id="outline-container-orgaad9451" class="outline-5">
<h5 id="orgaad9451"><span class="section-number-5">6.1.2.1</span> Youtube video</h5>
<div class="outline-text-5" id="text-6-1-2-1">
<p>
<iframe width="640" height="480" src="https://www.youtube.com/embed/AsogCoscZgE" frameborder="0" allowfullscreen></iframe>
</p>

<p>
<a href="https://youtu.be/AsogCoscZgE">Link here</a>
</p>
</div>
</div>

<div id="outline-container-org84eab77" class="outline-5">
<h5 id="org84eab77"><span class="section-number-5">6.1.2.2</span> Local video</h5>
<div class="outline-text-5" id="text-6-1-2-2">
<p>
<a href="../videos/MathCampFor9_520_6_860S-StatisticalLearningTheoryAndApplications.mp4">Video</a> file.
</p>
</div>
</div>

<div id="outline-container-org0302898" class="outline-5">
<h5 id="org0302898"><span class="section-number-5">6.1.2.3</span> Slides</h5>
<div class="outline-text-5" id="text-6-1-2-3">
<p>
Slides: <a href="../docs/mathcamp-slides.pdf">PDF</a>. <a href="http://www.mit.edu/~9.520/fall17/slides/mathcamp/mathcamp-slides.pdf">Original URL</a>.
Notes/Book appendix: <a href="../docs/mathcamp-fa-notes_book.pdf">PDF</a>. <a href="http://www.mit.edu/~9.520/fall17/slides/mathcamp/mathcamp-fa-notes_book.pdf">Original URL</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc37e7b" class="outline-4">
<h4 id="orgbc37e7b"><span class="section-number-4">6.1.3</span> Some concept testing with data</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
We like \(\mathbb{R}^D\) because we can
</p>

<p>
<b>Addition</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">v = [1, 2, 3];
w = [4, 5, 6];
println(v + w)
</pre>
</div>

<pre class="example">


[5, 7, 9]

</pre>

<p>
<b>Multiply by numbers</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">println(3 * v)
</pre>
</div>

<pre class="example">
[3, 6, 9]

</pre>

<p>
<b>Scalar product</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">println(v)
println(w)
dot(vec(v), vec(w))
dot(v, w)
</pre>
</div>

<pre class="example">
[1, 2, 3]
[4, 5, 6]
32
32

</pre>

<p>
<b>Norm</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">sqrt(dot(vec(v'), vec(v)))
vecnorm(v)
norm(v)
</pre>
</div>

<pre class="example">
3.7416573867739413
3.7416573867739413
3.7416573867739413

</pre>

<p>
<b>Distances between vectors</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">vecnorm(v - w)
norm(v - w)
</pre>
</div>

<pre class="example">
5.196152422706632
5.196152422706632

</pre>

<p>
<b>RMS value</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">norm(v) / sqrt(length(v))
</pre>
</div>

<pre class="example">
2.160246899469287

</pre>

<p>
<b>Standard deviation</b>
</p>

<p>
<i>Important note</i>: Julia do not use this definition.
</p>

<div class="org-src-container">
<pre class="src src-julia">norm(v - mean(v))/sqrt(length(v))
</pre>
</div>

<pre class="example">
0.8164965809277261

</pre>

<p>
Julia's way:
</p>

<div class="org-src-container">
<pre class="src src-julia">std(v)
</pre>
</div>

<pre class="example">
1.0

</pre>

<p>
<b>Angle between two vectors</b>
</p>

<div class="org-src-container">
<pre class="src src-julia">acos(dot(v, w)/(norm(v) * norm(w)))
</pre>
</div>

<pre class="example">
0.2257261285527342

</pre>

<p>
This what we called "Euclidean" structure. We want to do the samething
with \(D = \infty\)
</p>
</div>
</div>

<div id="outline-container-org891eaa5" class="outline-4">
<h4 id="org891eaa5"><span class="section-number-4">6.1.4</span> Cauchy-Schwarz inequality</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
\(\langle v, w \rangle \le \langle v, v \rangle^{\frac{1}{2}} \langle w, w \rangle^{\frac{1}{2}}\).
</p>

<div class="org-src-container">
<pre class="src src-julia">println(<span style="color: #5f9411; background-color: #eff8e9;">":: v and w inner product ::"</span>)
dot(v, w)
println(<span style="color: #5f9411; background-color: #eff8e9;">":: must be less or equal to ::"</span>)
sqrt(dot(v, v)) * sqrt(dot(w, w))
</pre>
</div>

<pre class="example">
:: v and w inner product ::
32
:: must be less or equal to ::
32.83291031876401

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef6bd3d" class="outline-2">
<h2 id="orgef6bd3d"><span class="section-number-2">7</span> Day 6 (Pending)</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4e7e090" class="outline-3">
<h3 id="org4e7e090"><span class="section-number-3">7.1</span> 9.520/6.860, Class 02</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgfda241b" class="outline-4">
<h4 id="orgfda241b"><span class="section-number-4">7.1.1</span> Description</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
We formalize the problem of learning from examples in the framework of
statistical learning theory and introduce key terms and concepts such
as loss functions, empirical and excess risk, generalization error and
consistency. We briefly describe foundational results and introduce
the concepts of hypothesis space and regularization.
</p>
</div>
</div>

<div id="outline-container-org4d1f88a" class="outline-4">
<h4 id="org4d1f88a"><span class="section-number-4">7.1.2</span> Class Reference Material</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
<b>L. Rosasco, T. Poggio, Machine Learning: a Regularization Approach,
MIT-9.520 Lectures Notes, Manuscript, Dec. 2017</b>.
</p>
</div>
</div>

<div id="outline-container-orgb62dbef" class="outline-4">
<h4 id="orgb62dbef"><span class="section-number-4">7.1.3</span> Chapter 1 - Statistical Learning Theory</h4>
<div class="outline-text-4" id="text-7-1-3">
<p>
Note: The course notes, in the form of the circulated book draft is
the reference material for this class. Related and older material can
be accessed through previous year offerings of the course.
</p>
</div>
</div>

<div id="outline-container-orgcb0d8fd" class="outline-4">
<h4 id="orgcb0d8fd"><span class="section-number-4">7.1.4</span> Further Reading</h4>
<div class="outline-text-4" id="text-7-1-4">
<ul class="org-ul">
<li>F. Cucker and S. Smale, <a href="http://www.mit.edu/~9.520/Papers/cuckersmale.pdf">On the mathematical foundations of learning</a>,
Bulletin of the American Mathematical Society, 2002.</li>
<li>T. Evgeniou, M. Pontil and T. Poggio, <a href="http://cbcl.mit.edu/projects/cbcl/publications/ps/evgeniou-reviewall.pdf">Regularization networks and
support vector machines</a>, Advances in Computational
Mathematics, 2000.</li>
<li>S. Villa, L. Rosasco and T. Poggio, <a href="http://arxiv.org/pdf/1303.5976v1.pdf">On learnability, complexity and
stability</a>, "Empirical Inference, Festschrift in Honor of Vladimir
N. Vapnik." Springer-Verlag, Chapter 7, 2013.</li>
<li>V. Vapnik, An overview of statistical learning theory, IEEE
Trans. on Neural Networks , 10(5), 1999.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb3e0bd" class="outline-4">
<h4 id="orgcb3e0bd"><span class="section-number-4">7.1.5</span> Video</h4>
<div class="outline-text-4" id="text-7-1-5">
<p>
<iframe width="640" height="480" src="https://www.youtube.com/embed/SFxypsvhhMQ" frameborder="0" allowfullscreen></iframe>
</p>

<p>
<a href="https://youtu.be/SFxypsvhhMQ">Link here</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf64e6e4" class="outline-2">
<h2 id="orgf64e6e4"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li><a href="../docs/MLNotes.pdf">Introductory Machine Learning Notes. Lorenzo Rosasco,
MIT, 2017</a>. <a href="http://lcsl.mit.edu/courses/ml/1718/MLNotes.pdf">Original URL</a>.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 05/07/2018</p>
<p class="author">Author: Sergio-Feliciano Mendoza-Barrera</p>
<p class="date">Created: 2018-07-10 Tue 21:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
